<?php

/*******************************************************************************************************/
/** OBJECT ORIENTED PROGRAMMING LANGAGE                                                               **/
/*******************************************************************************************************/
/** CLASS name: DatabaseReadZoo (child of the class DatabaseRead)                                     **/
/*******************************************************************************************************/
/** AUTHOR: Marc L. Harnist                                                                           **/
/*******************************************************************************************************/
/** CREATION: 28/03/2018                                                                              **/
/*******************************************************************************************************/
/** UPDATED: 28/03/2018                                                                               **/
/*******************************************************************************************************/
/** FILE USING THIS CLASS: controller/aller-au-cafe                                                   **/
/**                                                                                                   **/
/*******************************************************************************************************/
/** FUNCTION INSIDE: read_database                                                                  **/
/**                                                                                                   **/
/*******************************************************************************************************/
class DatabaseReadZoo extends Database {

		protected $nom; // nom de l'espèce d'animaul de la colonne nom de la table
		protected $table   = "zoo_espece"; // nombre d'animaux par espèce
		public $message;
		
		/**********************************************************************************************/
		/**     Nom : construct                                                                      **/
		/**********************************************************************************************/
		/**     Description : crée l'objet Database, et se connecte à la base de donnée mysql        **/
        /**                   en utilisant une fonction (connect()) de la classe mère (Database)     **/
		/**                                                    		                                 **/
		/**********************************************************************************************/
		/**     Paramètres : [string] : nom de l'espèce animale que nous voulons lire dans la base de */
		/**                             donnée mysql                                                 **/
		/**********************************************************************************************/
		/**     Valeurs retournées : [BOOL] object avec les données de la base de données pour       **/
		/**                           cette ligne du tableau de la base de données.                  **/
		/**********************************************************************************************/
		/**     Auteur : Marc L. Harnist                                                             **/
		/**********************************************************************************************/
		/**     Version : 1.0                                                                        **/
		/**********************************************************************************************/
		/**     Créée le : 21/03/2018                                                                **/
		/**********************************************************************************************/
		/**     Modifiée le : 28/03/2018                                                             **/	/**********************************************************************************************/	

		public function __construct()
		{
			parent::__construct();
		}

		// 2. READ   
		// R from CRUD - Database Read

		/**********************************************************************************************/
		/**     Nom : read_database                                                                **/
		/**********************************************************************************************/
		/**     Description : enregistre l'attribut $this->content dans la base de données mysql     **/
		/**                   dans la table "zoo_espece"                                                 **/
		/**                                                    		                                 **/
		/**********************************************************************************************/
		/**     Paramètres : [string] ligne à coller à la suite de la base de donnée                 **/
		/**********************************************************************************************/
		/**     Valeurs retournées : [BOOL] renvoie false si il y a un doublon (nbre anim.limité)******/
		/**********************************************************************************************/
		/**     Auteur : Marc L. Harnist                                                             **/
		/**********************************************************************************************/
		/**     Version : 1.0                                                                        **/
		/**********************************************************************************************/
		/**     Créée le : 21/03/2018                                                                **/
		/**********************************************************************************************/
		/**     Modifiée le : 21/03/2018                                                             **/	/**********************************************************************************************/	
		function read_database($nom){
			$this->nom = $nom;
			
			// ATTENTION: respectez bien l'ordre des ' et des " N'oubliez pas non plus les . (concaténation)
			$mysql_request = 'SELECT * FROM ' . $this->table . ' WHERE nom = "' . $this->nom . '"';
	  
			// Mysql request ($stmt = preparing statement = état de préparation = une convention de codeurs)
			$stmt = $this->db->query($mysql_request);
			$zoo_espece = $stmt->fetch(PDO::FETCH_ASSOC);

			return $zoo_espece;
		}
	} // Close the class